tutorials/fluid/hotRoomComfort/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 302;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 290;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
